# IFC_DMDeleteField

## Description
Deletes a field from current IFC Data Mapping.

```pascal
FUNCTION IFC_DMDeleteField(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMDeleteField(inStrObjName, inStrEntryName, inStrFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|inStrFieldName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC